[
    {
      "Name": "Cocktails & Drinks",
      "Description": "Recipe inspiration for everything from classic blends and mocktails to seasonal tipples and refreshing, fruity favourites.",
      "SubCategories": [
        {
          "Name": "Rum cocktail recipes",
          "Description": "Transport yourself to the tropics with a rum cocktail. Enjoy white or dark varieties in a punch, mojito, daiquiri or the classic piña colada."
        },
        {
          "Name": "Martini recipes",
          "Description": "Make a classic martini cocktail by mixing gin and dry vermouth then try exciting new twists from mince pie and espresso to courgette and cucumber."
        },
        {
          "Name": "Bonfire Night drinks recipes",
          "Description": "Warm up with a hot drink, or a cheeky cocktail on Fireworks Night. We have recipes for hot chocolate, mulled punch, or a classic hot toddy."
        },
        {
          "Name": "Halloween drinks and cocktail recipes",
          "Description": "Serve a range of spine-tingling drinks at your Halloween party. We have cocktails and mocktails, including a black vodka creation and blood-red punch."
        },
        {
          "Name": "Summer drink recipes",
          "Description": "Quench your thirst with these refreshing summer drinks including fruity punch and gin cocktails, cordials, juice blends and cooling slushies."
        },
        {
          "Name": "Easy cocktail recipes",
          "Description": "Raise a glass to our simple cocktail recipes! We have all manner of martinis, mojitos, gin drinks and more that are quick and easy to make when you're entertaining."
        },
        {
          "Name": "Christmas drinks & cocktail recipes",
          "Description": "Celebrate Christmas and New Year's Eve with our seasonal festive drinks. Keep guests' glasses topped up with everything from traditional mulled wine to easy cocktails and mocktails."
        },
        {
          "Name": "Student cocktail recipes",
          "Description": "Get the party started with our quick and easy cocktail recipes for students. We have all the classics like fruity rum punch, mojitos, Margaritas and more."
        },
        {
          "Name": "Punch recipes",
          "Description": "Enjoy a taste the tropics with our fruity punch recipe collection from refreshing summery Pimm's cocktails to warming apple pie and non-alcoholic varieties."
        },
        {
          "Name": "Mulled wine recipes",
          "Description": "Cosy up this winter with a warming glass of mulled wine. Our recipes, heady with spices and fruity sweetness, are sure to give you that festive feeling."
        },
        {
          "Name": "Coffee recipes",
          "Description": "Celebrate the irresistible flavour of coffee in our range of espresso cocktails and iced drinks or munch on cappuccino cakes, tiramisu, ice creams and more."
        },
        {
          "Name": "Hot chocolate recipes",
          "Description": "Enjoy a warm mug of cocoa on a cold day. Our collection also has boozy recipes for extra kick. How about a soothing mug of salted caramel rum hot chocolate?"
        },
        {
          "Name": "Our top 25 drink recipes",
          "Description": "Celebrate in style with our most popular cocktails, mocktails, spirits and mixers..."
        },
        {
          "Name": "Gin cocktail recipes",
          "Description": "Make the most of a brilliant bottle by turning it into a beautiful gin cocktail: from classic martinis and fruity mixes to new takes on traditional recipes."
        },
        {
          "Name": "Classy cocktail recipes",
          "Description": "Raise a toast with one of our tantalising tipples."
        },
        {
          "Name": "Vodka cocktail recipes",
          "Description": "Vodka is the ideal base spirit for a cocktail as it has a neutral flavour. Try it in a traditional blend, with plenty of fruit or in a clean, crisp mixed drink."
        },
        {
          "Name": "Non-alcoholic cocktail recipes",
          "Description": "Discover Good Food's best ever mocktail recipes for every occasion, including non-alcoholic punch, mulled drinks, juices, spritzers, cordials and coolers."
        },
        {
          "Name": "Cocktail recipes",
          "Description": "Serve these fan-favourite cocktails at your next party. See our best ever classic cocktails, including cosmopolitans, old fashioneds and mojitos."
        }
  
      ]
    },
  {
    "Name": "Budget",
    "Description": "Cooking on a budget has never been easier with our affordable recipes. Make the most of cheap ingredients and save money on student meals, family dishes and more.",
    "SubCategories": [
      {
        "Name": "Cheap family recipes",
        "Description": "Wholesome, budget suppers for the whole family."
      },
      {
        "Name": "Cheap cut recipes",
        "Description": "Slow-cooked recipes using good-value cuts of meat."
      },
      {
        "Name": "Cheap and healthy recipes",
        "Description": "Being healthy on a budget doesn't have to be hard. Try our easy recipes that are low in price but rich in nutritious ingredients and great flavour."
      },
      {
        "Name": "Leftovers recipes",
        "Description": "How to use up those leftover ingredients"
      },
      {
        "Name": "Student recipes",
        "Description": "Going to uni and never cooked before? Our student recipes are a great way to get started with easy, cheap and filling dishes that are packed with flavour."
      },
      {
        "Name": "Healthy student meal recipes",
        "Description": "Try our triple-tested, easy recipes and create nutritious and delicious meals on a student budget. We have inspiration for breakfast, lunch and dinner."
      },
      {
        "Name": "Cheap baking recipes",
        "Description": "Cakes, bakes, puddings and pies needn't cost the earth. Our budget baking recipes will help save the pennies."
      },
      {
        "Name": "Posh budget recipes",
        "Description": "Crowd-pleasing recipes that won't break the bank."
      },
      {
        "Name": "Budget soup recipes",
        "Description": "Save money with our simple soups using cheap ingredients. Costing only £1 or less per serving, these budget-friendly blends are big on flavour but low on cost."
      },
      {
        "Name": "Budget vegan recipes",
        "Description": "Get inspiration for delicious and affordable vegan recipes. Our budget-friendly plant-based meals include vegetable stews, curries, soups, salads and more."
      },
      {
        "Name": "Budget recipes",
        "Description": "Thrifty recipes to save you money in the kitchen. Try our budget-friendly salads, jacket potatoes or wraps for lunch, and our curries, pasta and pizza for dinner."
      }
    ]
  },
  {
    "Name": "Dinner ideas",
    "Description": "Get inspired with our best ever dinner recipes. From quick healthy meals to family suppers, we've got all the recipes you need.",
    "SubCategories": [
      {
        "Name": "Risotto recipes",
        "Description": "Master the art of this delicious Italian dish...easily."
      },
      {
        "Name": "Quick family recipes",
        "Description": "These speedy, simple suppers are guaranteed crowd-pleasers that will leave you time to enjoy with the family, or come in handy when you need to get dinner on the table, fast"
      },
      {
        "Name": "Pasta bake recipes",
        "Description": "Serve up a hearty pasta bake topped with melted cheese. These comforting dishes include lasagne, mac 'n' cheese and sausage pasta bake."
      },
      {
        "Name": "Pasta recipes",
        "Description": "Delicious pasta dishes from classic spaghetti Bolognese to lasagne and linguine. Find the perfect pasta recipe for midweek meals as well as easy pasta dishes you can rustle up using your storecupboard."
      },
      {
        "Name": "Healthy meal-for-one recipes",
        "Description": "If dining solo, treat yourself to a healthy and satisfying meal. We've got you covered for breakfast, lunch and dinner with recipes using fresh ingredients."
      },
      {
        "Name": "Macaroni cheese recipes",
        "Description": "Discover our best ever mac 'n' cheese recipes. Enjoy a classic, creamy pasta bake or add a twist with bacon, beer, crab or cauliflower."
      },
      {
        "Name": "Low-calorie dinner recipes",
        "Description": "Delicious dinners all under 400 calories."
      },
      {
        "Name": "Lasagne recipes",
        "Description": "Cook a classic Italian pasta bake for the family. We have all sorts of lasagne recipes, including traditional mince, seafood and veggie versions."
      },
      {
        "Name": "Healthy dinner recipes",
        "Description": "Discover BBC Good Food's best ever healthy dinner ideas. Get inspired by our nutritious, triple-tested recipes including vegetarian, vegan and meat options."
      },
      {
        "Name": "Gluten-free dinner recipes",
        "Description": "Suppertime menu options that skip grains and wheat."
      },
      {
        "Name": "Fish pie recipes",
        "Description": "Inspiration for a mash-topped seafood bake."
      },
      {
        "Name": "Family meal recipes",
        "Description": "Kids and grown-ups will love these family dinner ideas. Our simple suppers include comforting pasta bakes, warming one-pots and speedy stir-fries."
      },
      {
        "Name": "Dinner party dessert recipes",
        "Description": "Finish your evening in style with a decadent chocolate tart, fruity trifle, cheesecake or ice cream dessert. Our stunning yet simple puddings are sure to impress."
      },
      {
        "Name": "Dinner party main recipes",
        "Description": "From easy crowd-pleasing recipes to more impressive dishes for special occasions, try our dinner party main course ideas for fuss-free entertaining."
      },
      {
        "Name": "Dinner party starter recipes",
        "Description": "Kick off your meal in style with our chic selection of starters. From soups and salads to scallops and smoked salmon, these elegant dishes are sure to impress."
      },
      {
        "Name": "Dinner for two recipes",
        "Description": "Discover romantic recipes for two, including indulgent brunch dishes, starters, main courses and desserts."
      },
      {
        "Name": "Dairy-free dinner recipes",
        "Description": "Cut the heavy dairy out of your evening meal."
      },
      {
        "Name": "Chilli con carne recipes",
        "Description": "Make classic chilli con carne tonight for spicy comfort food, or try different options with beans, veggies or turkey mince. Serve with tortillas."
      },
      {
        "Name": "Chicken traybake recipes",
        "Description": "Fuss-free, one-pot poultry recipes to pop in the oven."
      },
      {
        "Name": "Chicken one-pot recipes",
        "Description": "Feed the family with our wholesome chicken one-pot recipes. These hearty casseroles, stews, roasts and risottos save on washing-up and maximise flavour."
      },
      {
        "Name": "Chicken curry recipes",
        "Description": "Perk up your poultry by adding spicy Asian flavours. Our recipes range from creamy and mild to sweet and hot."
      },
      {
        "Name": "Cheap and healthy recipes",
        "Description": "Being healthy on a budget doesn't have to be hard. Try our easy recipes that are low in price but rich in nutritious ingredients and great flavour."
      },
      {
        "Name": "Budget recipes",
        "Description": "Thrifty recipes to save you money in the kitchen. Try our budget-friendly salads, jacket potatoes or wraps for lunch, and our curries, pasta and pizza for dinner."
      },
      {
        "Name": "Bolognese recipes",
        "Description": "Bring on the Bolognese! This delicious Italian sauce is highly versatile and can be served, not only on spaghetti, but in pasta bakes and even tacos."
      }
    ]
  },
  {
    "Name": "Dishes",
    "Description": "Explore new cuisines, diets and crowd-pleasing spreads with all our favourite dishes. Find a recipe for every occasion.",
    "SubCategories": [
      {
        "Name": "Wrap recipes",
        "Description": "Roll up a savoury treat with tortillas and flatbreads."
      },
      {
        "Name": "Tart recipes",
        "Description": "A crisp golden base is the foundation for many a good meal."
      },
      {
        "Name": "Tapas recipes",
        "Description": "Enjoy a taste of Spain without ever having to leave your kitchen. Our mix & match tapas dishes are perfect finished with a refreshing glass (or jug!) of sangria."
      },
      {
        "Name": "Tagine recipes",
        "Description": "Stir up the fragrant flavours of North Africa in a hearty casserole."
      },
      {
        "Name": "Takeaway  recipes",
        "Description": "Ditch the Friday night takeaway and whip up your own version. From pizza and curries to pad Thai and chicken katsu, we've got plenty of fabulous fakeaway recipes for you to enjoy."
      },
      {
        "Name": "Stir-fry  recipes",
        "Description": "Use our speedy one-pan recipes to sizzle up an Asian-style spice pot in mere minutes."
      },
      {
        "Name": "Soup recipes",
        "Description": "Be bowled over by our nourishing soups. Our warming recipes range from classic minestrone and vibrant tomato soup to blends such as celeriac, hazelnut and truffle."
      },
      {
        "Name": "Smoothie recipes",
        "Description": "For a natural energy drink or a filling breakfast, try whizzing up one of our nutritious smoothies using seasonal fruit and veg."
      },
      {
        "Name": "Sandwich recipes",
        "Description": "Thrilling fillings and tasty toppings for your bread, wraps, baps and buns. Our next level sarnies include classic club sandwiches, baguettes and picnic favourites."
      },
      {
        "Name": "Risotto recipes",
        "Description": "Master the art of this delicious Italian dish...easily."
      },
      {
        "Name": "Quiche recipes",
        "Description": "Quiche recipes for every occasion."
      },
      {
        "Name": "Pizza recipes",
        "Description": "Put down that takeaway menu and make your own pizza from our great selection, including simple Margherita, spicy salami, Sicilian and a super healthy option."
      },
      {
        "Name": "Pie recipes",
        "Description": "Perfect pastry and delicious fillings, both sweet and savoury. Cut a slice and dig in."
      },
      {
        "Name": "Chutney recipes",
        "Description": "Preserve a seasonal glut of fruit and veg to enjoy during the colder months or to give as a delicious festive gift. Our chutneys include apple, tomato, pineapple, cranberry and more."
      },
      {
        "Name": "Pasta bake recipes",
        "Description": "Serve up a hearty pasta bake topped with melted cheese. These comforting dishes include lasagne, mac 'n' cheese and sausage pasta bake."
      },
      {
        "Name": "Pasta recipes",
        "Description": "Delicious pasta dishes from classic spaghetti Bolognese to lasagne and linguine. Find the perfect pasta recipe for midweek meals as well as easy pasta dishes you can rustle up using your storecupboard."
      },
      {
        "Name": "One-pot recipes",
        "Description": "Create comfort in a pot with these filling, sumptuous recipes, such as sausage & lentil one-pot and fish with black olives & tomatoes."
      },
      {
        "Name": "Omelette recipes",
        "Description": "Exciting ideas for fluffy and filling omelettes."
      },
      {
        "Name": "Noodle recipes",
        "Description": "Noodles make the perfect speedy, midweek supper. Flash fry some egg noodles for an Asian-style dish, or experiment with buckwheat, rice or soba noodles."
      },
      {
        "Name": "Meatball recipes",
        "Description": "Use up mince to make delicious meatballs. We have recipes for pork, turkey, lamb and more. They're great in curries, sandwiches, or dolloped on spaghetti."
      },
      {
        "Name": "Lasagne recipes",
        "Description": "Cook a classic Italian pasta bake for the family. We have all sorts of lasagne recipes, including traditional mince, seafood and veggie versions."
      },
      {
        "Name": "Jam recipes",
        "Description": "A pot of homemade preserve always beats shop-bought. Spread these fruity jams on hot buttered toast or give them away as gifts."
      },
      {
        "Name": "Ice cream recipes",
        "Description": "Indulgent ices and refreshing sorbets for hot days."
      },
      {
        "Name": "Hummus recipes",
        "Description": "Try our tasty recipes for hummus (or houmous) and make your own chickpea dip with peas, peppers or beetroot. We have serving suggestions and dinner ideas."
      },
      {
        "Name": "Frittata recipes",
        "Description": "This baked egg dish, similar to omelette, works served both hot and cold and with a vast array of fillings."
      },
      {
        "Name": "Fish pie recipes",
        "Description": "Inspiration for a mash-topped seafood bake."
      },
      {
        "Name": "Curry recipes",
        "Description": "Rustle up a spicy supper using fish, vegetables or meat and a blend of rich flavours."
      },
      {
        "Name": "Crumble recipes",
        "Description": "Crumble is a classic pudding you can enjoy all year, from comforting apple & blackberry crumble to modern twists like peanut butter berry crisp."
      },
      {
        "Name": "Chicken salad recipes",
        "Description": "Serve up a bright, light plate of goodness."
      },
      {
        "Name": "Casserole recipes",
        "Description": "From slow-cooked stews to quick casseroles."
      },
      {
        "Name": "Burger recipes",
        "Description": "Discover our best burger recipes, with everything you'll ever need to put inside a bun, from juicy beef patties, to miso, chicken, turkey and veggie burgers."
      },
      {
        "Name": "Baked potato recipes",
        "Description": "Perfect your spud technique then pile our filling ideas high."
      }
    ]
  },
  {
    "Name": "Seasonal",
    "Description": "Make the most of seasonal fruit and veg with our favourite recipes that use ingredients at their peak.",
    "SubCategories": [
      {
        "Name": "Winter roasts recipes",
        "Description": "Cook up a roast to warm the soul. We've included our classic roast recipes, plus ideas for sides to serve with your main."
      },
      {
        "Name": "Winter warmer recipes",
        "Description": "Keep cosy indoors with our top winter dishes. From comforting one-pots and steaming soups to indulgent puddings and filling salads, you won't even notice the cold."
      },
      {
        "Name": "Top 20 spring recipes",
        "Description": "Celebrate spring with our favourite recipes of the season. Make the most of fresh, seasonal ingredients such as asparagus, spring greens, rhubarb and more."
      },
      {
        "Name": "Top 20 autumn recipes",
        "Description": "Make the most of the autumn season with our favourite comforting recipes. Try a family-friendly crumble, a filling soup or fresh veg roasted to perfection."
      },
      {
        "Name": "Summer soup recipes",
        "Description": "These light soups make for a perfect summer lunch. Our selection includes vegan and gluten-free options such as gazpacho, pho, ramen and vegetable soup."
      },
      {
        "Name": "Summer salad recipes",
        "Description": "Liven up your lunchbox, picnic or BBQ with fresh and vibrant summer salad recipes that guarantee soggy sandwiches will be a thing of the past."
      },
      {
        "Name": "Summer roast recipes",
        "Description": "Give your Sunday roast a summery makeover with these lighter versions of the traditional spread. Pair roast chicken with pilaf, barbecue a leg of lamb or go for baked whole salmon."
      },
      {
        "Name": "Summer drink recipes",
        "Description": "Quench your thirst with these refreshing summer drinks including fruity punch and gin cocktails, cordials, juice blends and cooling slushies."
      },
      {
        "Name": "Summer dessert recipes",
        "Description": "Make one of these tempting puds to round off a summer menu. Try a fruity trifle, pavlova, cheesecake or lemon tart – there's plenty of dessert inspiration here."
      },
      {
        "Name": "Summer cake recipes",
        "Description": "Get baking this summer with our gorgeous cakes celebrating seasonal produce. Our recipes include flavours like elderflower, citrus and berries."
      },
      {
        "Name": "Summer recipes",
        "Description": "Celebrate summer with our selection of luscious dishes including fresh salads, light main meals, and fruity desserts – perfect for al fresco dining."
      },
      {
        "Name": "Seasonal September recipes",
        "Description": "Blackberries, plums and more..."
      },
      {
        "Name": "Mad about May recipes",
        "Description": "Don't miss out on May's blooming bounty."
      },
      {
        "Name": "Easy summer recipes",
        "Description": "Don't be chained to the stove in the hot weather. We've got plenty of simple summer dishes, such as fresh salads, light nibbles and speedy desserts."
      }
    ]
  },
  {
    "Name": "Cakes & Baking",
    "Description": "Cupcakes, celebration cakes, muffins, and brownies – we've got something for every occasion, including gluten-free and low fat recipes.",
    "SubCategories": [
      {
        "Name": "Valentine’s baking recipes",
        "Description": "Find a bake to suit your beloved, from heart-shaped biscuits to beautiful cakes."
      },
      {
        "Name": "Wedding cake recipes",
        "Description": "Create a stunning wedding cake or beautiful cupcakes for that special day."
      },
      {
        "Name": "Traybake recipes",
        "Description": "Simple, no-fuss cakes, brownies, shortbread and other bakes to be cut into squares and feed a crowd."
      },
      {
        "Name": "Summer cake recipes",
        "Description": "Get baking this summer with our gorgeous cakes celebrating seasonal produce. Our recipes include flavours like elderflower, citrus and berries."
      },
      {
        "Name": "Scone recipes",
        "Description": "Best served warm and buttered- try out new sweet and savoury ideas."
      },
      {
        "Name": "Retro cake recipes",
        "Description": "Freshly baked traditional treats."
      },
      {
        "Name": "Quick cake recipes",
        "Description": "Simple and speedy bakes to try."
      },
      {
        "Name": "Polenta cake recipes",
        "Description": "Distinctive Italian-inspired cakes."
      },
      {
        "Name": "Muffin recipes",
        "Description": "Healthy, indulgent and savoury muffin recipes."
      },
      {
        "Name": "Low-fat cake recipes",
        "Description": "Scrumptious but not so naughty."
      },
      {
        "Name": "Halloween cake recipes",
        "Description": "Sink your teeth into bewitching cakes and bakes this Halloween. We have various tricky treats from spider web muffins and pumpkin cakes to eyeball pops."
      },
      {
        "Name": "Gluten-free cake recipes",
        "Description": "Having a gluten intolerance no longer means missing out on light, fluffy bakes."
      },
      {
        "Name": "Garden glut cake recipes",
        "Description": "Make the most of allotment veg with a cake using courgettes, parsnips, pumpkin, beetroot or the old favourite – carrot."
      },
      {
        "Name": "Fruity cake recipes",
        "Description": "Cakes bursting with fruity flavours."
      },
      {
        "Name": "Fruitcake recipes",
        "Description": "Bake one of our fabulous fruitcake recipes for a delicious slice to enjoy with your afternoon cuppa. Try a traditional, classic fruitcake, a chocolate twist or a show-stopping dessert."
      },
      {
        "Name": "Festive cake recipes",
        "Description": "Festive and fruity cakes."
      },
      {
        "Name": "Easy baking recipes",
        "Description": "Bake for relaxation with our enticingly simple recipes for foolproof sponge cakes, cupcakes, traybakes and biscuits. Ideal for an afternoon tea or cake sale."
      },
      {
        "Name": "Easter baking recipes",
        "Description": "Get baking for the Easter weekend. We've got traditional simnel cakes, hot cross buns, chocolate nests, Easter biscuits and plenty more tempting treats."
      },
      {
        "Name": "Cupcake recipes",
        "Description": "Go cupcake crazy and make all kinds of cute miniature bakes with fabulous frosting. We've got classic chocolate, quirky unicorn, lemon meringue and more..."
      },
      {
        "Name": "Cookie recipes",
        "Description": "Cookies make the perfect rainy afternoon treat. From gooey American chocolate chip cookies to melty shortbread, we've got a biscuit selection to please everyone."
      },
      {
        "Name": "Classic cake recipes",
        "Description": "Old favourites and traditional bakes – take your pick from our timeless collection"
      },
      {
        "Name": "Chocolate cake recipes",
        "Description": "Indulge in these irresistibly chocolatey bakes. Our gooey and decadent collection includes classic chocolate cakes, rich tortes and elaborate showstoppers."
      },
      {
        "Name": "Chocolate baking recipes",
        "Description": "Satisfy your sweet tooth with our decadent chocolate treats. Indulge in gooey chocolate cake, brownies, cookies, tarts and puddings."
      },
      {
        "Name": "Cheesecake recipes",
        "Description": "With a creamy filling and buttery biscuit base, who can resist this classic dinner party dessert? Choose from traditional, fruity or boozy cheesecakes with our round-up."
      },
      {
        "Name": "Celebration cake recipes",
        "Description": "Show-stopping cakes for occasions."
      },
      {
        "Name": "Caramel recipes",
        "Description": "Whether you love salted caramel, or a more traditional version in your puds and desserts, we have a recipe that will satisfy your sweet tooth."
      },
      {
        "Name": "Cake sale recipes",
        "Description": "Tempting treats to get the donations rolling in for summer fêtes and charity bake sales."
      },
      {
        "Name": "Brownie recipes",
        "Description": "Plain or embellished, moist and chocolatey recipes."
      },
      {
        "Name": "Bread recipes",
        "Description": "Fill the house with the aroma of freshly baked bread."
      },
      {
        "Name": "Biscuit recipes",
        "Description": "Fill your biscuit tin with tasty homemade treats such as cookies and shortbread. Our biscuit recipes are easy to bake and perfect for enjoying with a cup of tea."
      },
      {
        "Name": "Birthday cake recipes",
        "Description": "Celebrate a birthday by baking one of our stunning cakes..."
      },
      {
        "Name": "Baking recipes",
        "Description": "Discover our selection of all-time favourite bakes. Whether you fancy making bread, brownies, cookies, cakes or tarts, we've got the perfect recipe for every occasion."
      }
    ]
  },
  {
    "Name": "Quick & easy",
    "Description": "From curry in a hurry, to simple sauces and flash-cooked feasts, get creative with some last minute speedy suppers.",
    "SubCategories": [
      {
        "Name": "Quick Christmas recipes",
        "Description": "Save time on the big day with our speedy Christmas dinner dishes. From smoked salmon starters and easy roast turkey to last-minute puddings, we've got you covered."
      },
      {
        "Name": "Speedy suppers recipes",
        "Description": "Fast and fresh suppers for ravenous kids."
      },
      {
        "Name": "Quick Valentine’s Day  recipes",
        "Description": "Spend less time in the kitchen with our quick Valentine's Day recipes. Try our speedy ideas for mains and desserts and whip up a delicious, romantic meal in 20 minutes or less."
      },
      {
        "Name": "Quick nibbles recipes",
        "Description": "Feed a crowd with these quick and easy party snacks. Each is ready in just 20 minutes or less, making them perfect for a last-minute festive gathering. Choose from sweet or savoury canapés."
      },
      {
        "Name": "Quick winter recipes",
        "Description": "Warm up in winter with our simple, seasonal recipes. From noodles to pasta, we have something you can make in 20 minutes or less."
      },
      {
        "Name": "Quick dessert recipes",
        "Description": "Speedy sweets and easy, fuss-free puddings for those times when you need an after-dinner fix on the double. These recipes are ready in 20 minutes or under..."
      },
      {
        "Name": "Quick and healthy recipes",
        "Description": "Tuck into healthy recipes that you can make in under 30 minutes. We've got plenty of quick and tasty salads, soups and mains to leave you feeling nourished."
      },
      {
        "Name": "Quick family recipes",
        "Description": "These speedy, simple suppers are guaranteed crowd-pleasers that will leave you time to enjoy with the family, or come in handy when you need to get dinner on the table, fast"
      },
      {
        "Name": "Easy family curry recipes",
        "Description": "Try these flavoursome curries that will suit the whole family. From traditional Thai curries to Indian classics, there's a curry to suit every taste."
      },
      {
        "Name": "Quick summer recipes",
        "Description": "Spend less time in the kitchen and more time dining al fresco with these delicious dinners made for summer with fresh, seasonal ingredients"
      },
      {
        "Name": "Easy entertaining recipes",
        "Description": "Impress your guests with our deceptively simple showstoppers and sharing platters, so you spend less time in the kitchen and more with the party!"
      },
      {
        "Name": "Easy Christmas recipes",
        "Description": "Take the stress out of Christmas prep with these simple yet scrumptious recipes. We've got all the essentials covered, from easy roast turkey to no-fuss mince pies."
      },
      {
        "Name": "Easy cake recipes",
        "Description": "Baking doesn't need to be hard. Try our easy recipes for fuss-free treats like chocolate cake, lemon drizzle, sangria sponge and even an easy wedding cake!"
      },
      {
        "Name": "Easy summer recipes",
        "Description": "Don't be chained to the stove in the hot weather. We've got plenty of simple summer dishes, such as fresh salads, light nibbles and speedy desserts."
      },
      {
        "Name": "Quick and easy family pasta recipes",
        "Description": "Keep the family happy at dinner time with one of our best easy pasta recipes, ready in 30 minutes or less. They'll be a hit with all ages."
      },
      {
        "Name": "Easy vegan recipes",
        "Description": "Find a range of super-simple yet scrumptious vegan meals. Our easy meat-free and dairy-free recipes include curries, salads, bakes, rice dishes and desserts."
      },
      {
        "Name": "Easy cocktail recipes",
        "Description": "Raise a glass to our simple cocktail recipes! We have all manner of martinis, mojitos, gin drinks and more that are quick and easy to make when you're entertaining."
      },
      {
        "Name": "Easy brownie recipes",
        "Description": "You can’t beat homemade brownies. Indulge in easy bakes that work as a dessert with ice cream, or just with a cuppa for a coffee morning or afternoon tea."
      },
      {
        "Name": "Quick breakfast recipes",
        "Description": "Prone to rushed mornings? Take time out to put together one of our speedy breakfasts, all ready in 10 minutes or under"
      },
      {
        "Name": "Easy healthy recipes",
        "Description": "Healthy cooking doesn't have to be difficult. Our easy healthy recipes are packed full of nutritional benefits and couldn't be simpler to make"
      },
      {
        "Name": "Easy muffin recipes",
        "Description": "Make our easy muffins for breakfast, afternoon tea, or a coffee morning. Take your pick from tempting chocolate or fruit versions, plus cheesy savoury bakes."
      },
      {
        "Name": "Quick chicken recipes",
        "Description": "Whip up one of our quick chicken recipes in under 30 minutes for a handy midweek meal. Choose from speedy stir-fires, one-pots, casseroles, curries and more."
      },
      {
        "Name": "Easy barbecue recipes",
        "Description": "For fuss-free al fresco dining this summer, try our easy barbecue recipes with delicious chargrilled meats, vegetables, salads and side dishes."
      },
      {
        "Name": "Easy pasta recipes",
        "Description": "You can rely on our easy pasta recipes with fail-safe pasta bakes like mac 'n' cheese and pasta sauces like beef ragu that are perfect for a midweek meal."
      },
      {
        "Name": "Easy cookie recipes",
        "Description": "Bake cookies for the family and enjoy with a cuppa. These recipes are simple to make, from chocolate chip and soft oat cookies to unicorn biscuits."
      },
      {
        "Name": "Easy curry recipes",
        "Description": "In search of an easy curry to serve family and friends? Look no further than our collection of top-rated curry recipes, which pack in a real flavour punch."
      },
      {
        "Name": "15-minute meal recipes",
        "Description": "A quarter of an hour and some clever ingredients are all you need for a super-speedy, satisfying supper."
      },
      {
        "Name": "Easy biscuit recipes",
        "Description": "Fill your biscuit tin with goodies from our collection. Simple bakes like cookies, shortbread and crackers are great to make with kids."
      },
      {
        "Name": "Quick and easy family recipes",
        "Description": "Busy week? Make our quick and easy family recipes with one-pots, curries, pasta bakes and other simple dishes that kids and adults will love."
      },
      {
        "Name": "Under 20-minute recipes",
        "Description": "These speedy yet delicious recipes can be on the table in 20 minutes or less, so put your microwave meal away and get making these filling dinners."
      },
      {
        "Name": "Quick vegetarian recipes",
        "Description": "Rustle up a sumptuous veggie meal in half an hour or less. We've got pasta, curries, stir-fries and a whole host of other speedy vegetarian and vegan dishes."
      },
      {
        "Name": "Quick cake recipes",
        "Description": "Simple and speedy bakes to try."
      },
      {
        "Name": "Easy pudding recipes",
        "Description": "Whip up one of our comforting desserts with minimum fuss for a dinner party or family meal. Choose from super simple sponge puddings, brownies, tarts and more."
      },
      {
        "Name": "Easy but impressive recipes",
        "Description": "Less stress, more seduction..."
      },
      {
        "Name": "Easy baking recipes",
        "Description": "Bake for relaxation with our enticingly simple recipes for foolproof sponge cakes, cupcakes, traybakes and biscuits. Ideal for an afternoon tea or cake sale."
      },
      {
        "Name": "Easy recipes",
        "Description": "Keep it easy with these simple but delicious recipes. From make-ahead lunches and midweek meals to fuss-free sides and moreish cakes, we've got everything you need."
      },
      {
        "Name": "Quick recipes",
        "Description": "Quick and easy recipes that are simple to prepare and fast to cook"
      }

    ]
  },
  {
    "Name": "Everyday",
    "Description": "Simple and effective meals for midweek and lazy nights to suit a tight budget and busy lifestyle.",
    "SubCategories": [
      {
        "Name": "Storecupboard recipes",
        "Description": "Get the most out of your storecupboard staples in our delicious dinners, bakes and snacks. These simple, affordable recipes use everything from tinned tomatoes to flour and sugar."
      },
      {
        "Name": "Leftovers recipes",
        "Description": "How to use up those leftover ingredients"
      },
      {
        "Name": "Kids’ cooking recipes",
        "Description": "Get fussy little eaters into the kitchen and turn them into little chefs with our easy and fun cooking projects. They'll love tasting their handiwork, too!"
      },
      {
        "Name": "Freezable recipes",
        "Description": "Get ahead in a busy week by making a batch of your favourite meal then freezing the rest for another day. Try it with our recipes for pies, curries, one-pots and soups."
      },
      {
        "Name": "Five ingredients or less recipes",
        "Description": "Quick fix recipes with minimal shopping fuss."
      },
      {
        "Name": "Family meal recipes",
        "Description": "Kids and grown-ups will love these family dinner ideas. Our simple suppers include comforting pasta bakes, warming one-pots and speedy stir-fries."
      },
      {
        "Name": "Comfort food recipes",
        "Description": "Our comfort food classics will warm you up on a winter's night. Tuck into cheesy pasta bakes, satisfying pies, hearty stews, indulgent puddings and more."
      },
      {
        "Name": "Cheap eat recipes",
        "Description": "Low-cost, budget-friendly meals that are packed full of flavour."
      },
      {
        "Name": "Batch cooking recipes",
        "Description": "Need to get ahead with food prep for the week? Try batch cooking one of our easy recipes and freezing the leftovers for a speedy midweek meal."
      }
    ]
  },
  {
    "Name": "Christmas",
    "Description": "From turkey to sprouts, and mince pies to party puddings – whatever festive feast you're cooking this Christmas, eat, drink and be merry with all our festive recipes.",
    "SubCategories": [
      {
        "Name": "Vegetarian Christmas starter recipes",
        "Description": "Kick off your Christmas dinner menu with one of our impressive and tasty meat-free starters. Get creative with soups, salads, tarts and other veggies dishes."
      },
      {
        "Name": "Vegetarian Christmas recipes",
        "Description": "Enticing meat-free recipes for the festive season, including main courses, starters and snacks."
      },
      {
        "Name": "Vegan Christmas recipes",
        "Description": "Serve up a festive, plant-based feast with our vegan Christmas starters, mains, sides and desserts. Choose from nut roasts, Christmas puddings, pies and more."
      },
      {
        "Name": "Turkey recipes",
        "Description": "Our incredible turkey recipes make the perfect crowd-pleasing centrepiece, whether you want a traditional roast, a simple turkey crown recipe or a modern bird with all the trimmings."
      },
      {
        "Name": "Quick nibbles recipes",
        "Description": "Feed a crowd with these quick and easy party snacks. Each is ready in just 20 minutes or less, making them perfect for a last-minute festive gathering. Choose from sweet or savoury canapés."
      },
      {
        "Name": "Nut-free Christmas recipes",
        "Description": "Brilliant alternatives to traditional festive foods."
      },
      {
        "Name": "Vegetarian Christmas canapé recipes",
        "Description": "Meat-free nibbles, morsels and bites to cater for everyone."
      },
      {
        "Name": "New Year’s Eve recipes",
        "Description": "Start the new year in style with a selection of glamorous party puds, buffet dishes, cocktails and canapés that are sure to impress guests."
      },
      {
        "Name": "Mince pies recipes",
        "Description": "Deep & decadent or simple & speedy - we have all mince pies covered!"
      },
      {
        "Name": "Make-ahead Christmas recipes",
        "Description": "Save time and stress on Christmas Day with our make-ahead dishes. These stuffings, sauces, sides and desserts can be prepared in advance, then kept in the fridge or freezer."
      },
      {
        "Name": "Low-fat Christmas recipes",
        "Description": "Tempting ways to take the guilt out of the festive feasting."
      },
      {
        "Name": "Low-calorie Christmas recipes",
        "Description": "Low-calorie festive favourites..."
      },
      {
        "Name": "Leftover Christmas turkey recipes",
        "Description": "The big bird yields lots of extra meat. Waste not, want not with our economical meals for post-Christmas turkey leftovers."
      },
      {
        "Name": "Last-minute Christmas recipes",
        "Description": "No-fuss menu ideas, cakes and gifts."
      },
      {
        "Name": "Christmas for kids recipes",
        "Description": "Have some festive fun with the kids, with this selection of recipes that can be made by the smallest of hands."
      },
      {
        "Name": "Healthy Christmas leftovers recipes",
        "Description": "Nutritious and delicious ways to use up your festive fare..."
      },
      {
        "Name": "Healthy Christmas side dish recipes",
        "Description": "Pick healthy sides this Christmas with our best rated selection of recipes. They make the perfect accompaniments for a thoroughly festive dinner."
      },
      {
        "Name": "Healthy Christmas party recipes",
        "Description": "Entertaining over the holidays? Get inspired with our healthy Christmas party food – they're perfect for a crowd."
      },
      {
        "Name": "Healthy Christmas canapés recipes",
        "Description": "Hosting a party this Christmas? Make festive canapés that are healthy as well as delicious, including prosciutto crostini and dressed crab cups."
      },
      {
        "Name": "Healthy Christmas buffet recipes",
        "Description": "Who says Christmas can't be healthy? Get inspired with our healthy festive buffet ideas that will prove a big hit at any party or family gathering."
      },
      {
        "Name": "Healthy Christmas recipes",
        "Description": "Our best ever healthy festive dishes make a wholesome addition to your Christmas Day spread, including roast centrepieces, starters and sides."
      },
      {
        "Name": "Hangover recipes",
        "Description": "The best hangover food to soothe and sustain if you've had a few too many tipples the night before, including toasties, omelettes and smoothies."
      },
      {
        "Name": "Gluten-free Christmas recipes",
        "Description": "There's no need to miss out with these gluten-free recipes."
      },
      {
        "Name": "Festive starter recipes",
        "Description": "Kick-start your Christmas dinner with an easy-but-impressive starter. Our festive recipes include sharing plates, smoked salmon dishes, salads, soups and more."
      },
      {
        "Name": "Festive main course recipes",
        "Description": "Dare to be different with our favourite festive mains."
      },
      {
        "Name": "Christmas drinks & cocktail recipes",
        "Description": "Celebrate Christmas and New Year's Eve with our seasonal festive drinks. Keep guests' glasses topped up with everything from traditional mulled wine to easy cocktails and mocktails."
      },
      {
        "Name": "Christmas dessert recipes",
        "Description": "Try our selection of traditional and alternative Christmas desserts for the festive season. We've got Christmas pudding, mince pies, trifle, cheesecake and more."
      },
      {
        "Name": "Festive cake recipes",
        "Description": "Festive and fruity cakes."
      },
      {
        "Name": "Easy Christmas dessert recipes",
        "Description": "Make an easy Christmas dessert and have more time to enjoy with your party guests. Choose a favourite from our best simple festive puds."
      },
      {
        "Name": "Easy Christmas recipes",
        "Description": "Take the stress out of Christmas prep with these simple yet scrumptious recipes. We've got all the essentials covered, from easy roast turkey to no-fuss mince pies."
      },
      {
        "Name": "Decoration recipes",
        "Description": "Treats for the tree and the rest of your home."
      },
      {
        "Name": "Dairy-free Christmas recipes",
        "Description": "Delicious Christmas ideas without the dairy..."
      },
      {
        "Name": "Christmas trimmings recipes",
        "Description": "Make these essential sides for Christmas dinner. We've got everything you need, from roast potatoes and parsnips, to Brussels sprouts, pigs in blankets and cabbage."
      },
      {
        "Name": "Trifle recipes",
        "Description": "Fruit, cream, custard, sponge... What's not to love about this traditional layered dessert?"
      },
      {
        "Name": "Christmas sweets recipes",
        "Description": "These tempting Christmas sweets make perfect stocking fillers, gifts or treats. Our festive confectionary includes fudge, truffles, candy canes, chocolate bark and much more."
      },
      {
        "Name": "Christmas stuffing recipes",
        "Description": "Accompany your Christmas dinner with these scrumptious stuffing recipes. We've got classic sausagemeat versions with fruit and nuts, plus vegetarian and vegan alternatives."
      },
      {
        "Name": "Christmas sprouts recipes",
        "Description": "Spruce up your Brussels sprouts for Christmas. Serve a classic side dish of sprouts with bacon and chestnuts, or try our cheesy sprout gratin and vegan sides."
      },
      {
        "Name": "Christmas soup recipes",
        "Description": "Blitz up a comforting bowl of soup using seasonal winter veg such as celeriac, chestnuts and parsnips. We've got smooth broths and chunky bowls, perfect for starters or light meals."
      },
      {
        "Name": "Christmas smoked salmon recipes",
        "Description": "Add a touch of luxury to festive brunches, starters and canapés with smoked salmon."
      },
      {
        "Name": "Christmas side dish recipes",
        "Description": "A selection of sides and sauces to accompany your festive feast. Our tasty trimmings include roast potatoes, sprouts, stuffing, pigs in blankets and cabbage."
      },
      {
        "Name": "Christmas sauce recipes",
        "Description": "Must-have accompaniments for festive feasts."
      },
      {
        "Name": "Christmas roast potato recipes",
        "Description": "Perfect your roasties for the big day."
      },
      {
        "Name": "Red cabbage recipes",
        "Description": "This vibrant brassica goes a long way when you have lots of hungry mouths to feed. Try our Christmas red cabbage recipes and serving suggestions."
      },
      {
        "Name": "Christmas recovery recipes",
        "Description": "Healthy pick-me-ups to beat the festive excess."
      },
      {
        "Name": "Christmas pudding recipes",
        "Description": "Whether you make yours on Stir-up Sunday, or you need a last-minute pud for Christmas Day, we have the answer with fruity, nutty and chocolatey recipes."
      },
      {
        "Name": "Christmas parsnip recipes",
        "Description": "Get creative with this sweet root."
      },
      {
        "Name": "Christmas pâté recipes",
        "Description": "Serve our festive pâté recipes for a delicious Christmas dinner starter. Choose from port and chicken liver pâté, vegan mushroom pâté and more."
      },
      {
        "Name": "Christmas leftovers recipes",
        "Description": "Use up your Christmas dinner leftovers, including turkey and all the trimmings. From stir-fries to pies, these recipes are packed with festive flavour."
      },
      {
        "Name": "Christmas ham recipes",
        "Description": "Feed a crowd with a festive gammon joint. We have ideas for marinades, glazes and ways to serve it."
      },
      {
        "Name": "Christmas gravy recipes",
        "Description": "From fruity favourites to boozy boats"
      },
      {
        "Name": "Boxing Day recipes",
        "Description": "Whether it's a stunning ham centrepiece or a mash-up of Christmas leftovers, we've got a selection of Boxing Day recipes to impress family and friends."
      },
      {
        "Name": "Gingerbread recipes",
        "Description": "Bake a batch of festive gingerbread biscuits to give as gifts, hang on the tree or devour straight away. Kids will love decorating our easy cookies and ornate gingerbread houses."
      },
      {
        "Name": "Christmas gift recipes",
        "Description": "Why go shopping when you can make Christmas presents at home? We have lots of ideas for gourmet gifts that your foodie friends will love."
      },
      {
        "Name": "Christmas cupcake recipes",
        "Description": "Bake a batch of festive cupcakes to enjoy over the Christmas holidays. Kids will love making and decorating these simple sponges."
      },
      {
        "Name": "Christmas cracker and biscuit recipes",
        "Description": "Stack a hamper high with crunchy treats."
      },
      {
        "Name": "Christmas chutney recipes",
        "Description": "Great for gift hampers and served with festive meat and cheese"
      },
      {
        "Name": "Christmas chocolate recipes",
        "Description": "Treat yourself to something sweet for Christmas. Our indulgent chocolate recipes include chocolate bark, truffles, biscuits, and desserts such as yule logs and mince pie brownies."
      },
      {
        "Name": "Christmas cheeseboard recipes",
        "Description": "Pickles, biscuits and ideas for cheese"
      },
      {
        "Name": "Christmas centrepiece recipes",
        "Description": "Discover showstopping turkey alternatives for your Christmas dinner. We have delicious recipes for pork, beef, goose and salmon, plus plenty of veggie options."
      },
      {
        "Name": "Christmas canapé recipes",
        "Description": "Sophisticated sweet and savoury bites to serve at your festive party or as a light starter"
      },
      {
        "Name": "Christmas cake recipes",
        "Description": "Celebrate Christmas with a rich, moist fruitcake, or perhaps a modern sponge-based creation. We've got all the recipes you need and tips for decorating, too."
      },
      {
        "Name": "Christmas buffet recipes",
        "Description": "Entertaining a crowd this Christmas? We have all the buffet dishes you need for a festive party, including canapés, dips and easy sharing plates."
      },
      {
        "Name": "Christmas brunch recipes",
        "Description": "Discover Christmas brunch ideas to start your day in style. Celebrate Christmas morning with festive breads, pancakes, eggs, smoked salmon and more."
      },
      {
        "Name": "Christmas biscuit recipes",
        "Description": "From cookies and gingerbread, to biscotti and shortbread, bake up a storm this festive season."
      },
      {
        "Name": "Christmas baking recipes",
        "Description": "Crumbly mince pies, iced cakes and traditional festive breads like stollen and panettone – find all your favourite Christmas cakes and bakes here."
      },
      {
        "Name": "Christmas recipes",
        "Description": "Make a stunning dinner for a crowd, delicious party canapés for every diet, festive desserts and much more with our best ever Christmas recipes."
      }
    ]
  }
  ]
  